clear;
clc;
clear all;

f = @(x) x .* sin(10 * pi * x) + 2.;% f(x) = sin(10 * pi * x) + 2, x取值范围[-1, 2]
%f = @(x) sin(x) + x .* cos(x);		% 函数表达式
fplot(f, [-1, 2]);					% 画出函数图像

N = 50;								% 种群上限
L = 10;								% 基因长度
iter = 100;							% 迭代次数
dna = randi([0, 1], [N, L]);		% 基因，rand()参数1是每个数的取值范围，参数2是矩阵的行列值


% 解码尝试
% 解码可以理解为，在所求区间内，线性地铺开所有的值
% 那么则有，实际值和目标值的函数关系
% f(dna) = k * dna + b;
% b肯定是区间的起始值
% k可以理解为这个区间被均匀地等分成多少份
% k = 3 / (2^10 - 1), 区间长度是2 - -1 = 3，而分成2^10份，取值范围就是[0, 2^10 - 1];
dcd = [ 512; 256; 128; 64; 32; 16; 8; 4; 2; 1 ];

num = dna * dcd * ((2 - -1) / (2^10 - 1)) - 1;

